/*
Äàâàéòå ïîïğîáóåì ïåğåâåñòè íå ñàìîå òğèâèàëüíîå âûğàæåíèå èç åñòåñòâåííîãî ğóññêîãî ÿçûêà â Java âûğàæåíèå.

Ğåàëèçóéòå ìåòîä, âîçâğàùàşùèé ğåçóëüòàò ïîáèòîâîãî ñëîæåíèÿ (îïåğàöèÿ ÈËÈ) äâóõ âåëè÷èí:
1) Ñòî ìèëëèàğäîâ ïî ìîäóëş a, àğèôìåòè÷åñêè ïîáèòîâî ñäâèíóòîå íà b ïîçèöèé âïğàâî.
2) Ñòî, öåëî÷èñëåííî ïîäåë¸ííîå íà c.

Îïåğàöèÿ âñåãäà äîïóñòèìà. (Îøèáêè, ê ïğèìåğó, äåëåíèå íà íîëü íå ïğèñóòñòâóşò)
Â êà÷åñòâå ïğèìåğà íàïèñàíî çàâåäîìî íåïğàâèëüíîå âûğàæåíèå. Èñïğàâüòå åãî.
Sample Input:
589 5 9
Sample Output:
27
*/

public long longExpression(int a, int b, int c) {
    //long billion = 100000000000L;    
    //a = billion % a;
    //a = a >> b;
    //c = 100 / c;
    return ( (100000000000L % a) >> b ) | (100 / c);
    //return a + b + c;
}